Revit 2027 API
ParameterTypeId.ProjectAuthor Property
 "Author"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectAuthor { get; }
Public Shared ReadOnly Property ProjectAuthor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectAuthor {
	ForgeTypeId^ get ();
}
static member ProjectAuthor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace